stress-test/reports/logs/goods_list.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8001

Document Path:          /api/goods/list?page=1&pageSize=20
Document Length:        43 bytes

Concurrency Level:      100
Time taken for tests:   0.071 seconds
Complete requests:      1000
Failed requests:        986
   (Connect: 0, Receive: 0, Length: 986, Exceptions: 0)
Total transferred:      141140 bytes
HTML transferred:       33140 bytes
Requests per second:    13989.54 [#/sec] (mean)
Time per request:       7.148 [ms] (mean)
Time per request:       0.071 [ms] (mean, across all concurrent requests)
Transfer rate:          1928.21 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.3      0       6
Processing:     0    5   4.3      4      23
Waiting:        0    4   4.1      3      23
Total:          0    6   5.0      5      29

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      6
  75%      7
  80%      9
  90%     13
  95%     17
  98%     20
  99%     23
 100%     29 (longest request)